Revit 2027 API
PropertyTableEntry.ArcDirection Property
 Represent the arc direction, PT_Left means the arc appears to the left of the line segment. Right means the arc appears to the right of the line segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PropertyTableEntryArcDirection ArcDirection { get; }
Public ReadOnly Property ArcDirection As PropertyTableEntryArcDirection
	Get
public:
property PropertyTableEntryArcDirection ArcDirection {
	PropertyTableEntryArcDirection get ();
}
member ArcDirection : PropertyTableEntryArcDirection with get
Property Value
PropertyTableEntryArcDirection
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace